In [76]:
import pandas as pd

In [77]:
a = [1, 7, 2]
myvar = pd.Series(a)
print(myvar)

0    1
1    7
2    2
dtype: int64

In [78]:
a = [1, 7, 2]
myvar = pd.Series(a, index = ["x", "y", "z"])
print(myvar)

x    1
y    7
z    2
dtype: int64

In [79]:
print(myvar["y"])

7

In [80]:
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(calories)
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [81]:
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(calories, index = ["day1", "day2"])
print(myvar)

day1    420
day2    380
dtype: int64

In [82]:
data = {
    "calories": [420, 380, 390],
    "duration": [50, 40, 45]
}
df = pd.DataFrame(data, index = ["day1", "day2", "day3"])
print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [ ]:
value = df.loc["day1", "calories"]
print(value)

420

In [84]:
df.iloc[0, 0]

420

In [85]:
df.iloc[[0, 0]]

      calories  duration
day1       420        50
day1       420        50

In [86]:
df.loc["day1":"day2", ["calories", "duration"]]

      calories  duration
day1       420        50
day2       380        40

In [87]:
df.loc["day1"]

calories    420
duration     50
Name: day1, dtype: int64

In [88]:
df.loc[:, ["calories", "duration"]]

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [89]:
df.loc["day1", "calories"], df.loc["day1", "duration"]

(420, 50)

In [90]:
df.loc["day1"]["calories"], df.loc["day1"]["duration"]

(420, 50)

In [91]:
df.loc["day1"].calories, df.loc["day1"].duration

(420, 50)

In [92]:
df.loc[["day1", "day3"], ["calories", "duration"]]

      calories  duration
day1       420        50
day3       390        45

In [93]:
df.iloc[[0, 2], [0, 1]]

      calories  duration
day1       420        50
day3       390        45

In [94]:
df

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [95]:
position = "day1"
label = "calories"
df.at[position, label]

420

In [96]:
df

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [97]:
df.index[0]

'day1'

In [98]:
df.reset_index(inplace = True)
df.index[0]

0

In [99]:
s1 = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
s2 = pd.Series([5, 15, 25], index=['b', 'c', 'd'])

result = s1 + s2
print(result)

a     NaN
b    25.0
c    45.0
d     NaN
dtype: float64

In [100]:
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]}, index=['x', 'y'])
df2 = pd.DataFrame({'B': [5, 6], 'C': [7, 8]}, index=['y', 'z'])
result = df1 + df2
print(result)

    A    B   C
x NaN  NaN NaN
y NaN  9.0 NaN
z NaN  NaN NaN

In [101]:
df1

   A  B
x  1  3
y  2  4

In [102]:
df2

   B  C
y  5  7
z  6  8

In [103]:
movies = {
    'Name': ['The Godfather', 'Bird Box', 'Fight Club'],
    'Year': ['1972', '2018', '1999'],
    'Rating': ['9.2', '6.8', '8.8']
}
df = pd.DataFrame(movies)
df

            Name  Year Rating
0  The Godfather  1972    9.2
1       Bird Box  2018    6.8
2     Fight Club  1999    8.8

In [104]:
df['Rating_Rank'] = df['Rating'].rank(ascending = True)
df = df.set_index('Rating_Rank')
df

                      Name  Year Rating
Rating_Rank
3.0          The Godfather  1972    9.2
1.0               Bird Box  2018    6.8
2.0             Fight Club  1999    8.8

In [105]:
df = pd.DataFrame({
'A': [1, 2, 3],
'B': [4, 5, 6],
'C': [7, 8, 9]
})
df['A'].cumsum()

0    1
1    3
2    6
Name: A, dtype: int64

In [106]:
arrays = ['Sohom','Suresh','Kumkum','Subrata']
age= [10, 11, 12, 13]
marks=[90,92,23,64]
multi_index = pd.MultiIndex.from_arrays([arrays,age,marks], names=('names', 'age','marks'))
print(multi_index)

MultiIndex([(  'Sohom', 10, 90),
            ( 'Suresh', 11, 92),
            ( 'Kumkum', 12, 23),
            ('Subrata', 13, 64)],
           names=['names', 'age', 'marks'])

In [107]:
arrays = [
["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
["one", "two", "one", "two", "one", "two", "one", "two"],
]
tuples = list(zip(*arrays))
index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])
print(index)

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [108]:
iterables = [["bar", "baz", "foo", "qux"], ["one", "two"]]
pd.MultiIndex.from_product(iterables, names=["first", "second"])

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [160]:
import numpy as np
# arrays = [
#     np.array(["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"]),
#     np.array(["one", "two", "one", "two", "one", "two", "one", "two"]),
# ]
# index = pd.MultiIndex.from_product(
#     [["bar", "baz", "foo", "qux"], ["one", "two"]], names=["first", "second"]
# )
index = pd.MultiIndex.from_tuples(
    [("bar", "one"), ("bar", "two"), ("baz", "one"), ("baz", "two"), ("foo", "one"), ("foo", "two"), ("qux", "one"), ("qux", "two")],
    names=["first", "second"],
)
s = pd.Series(np.random.randn(8), index=index)
s

first  second
bar    one      -0.626516
       two       0.337799
baz    one      -0.736652
       two       2.507863
foo    one       0.784828
       two       0.336552
qux    one      -1.238619
       two      -2.025696
dtype: float64

In [110]:
pd.Series(np.random.randn(8), index=pd.MultiIndex.from_product(iterables))

bar  one   -1.242281
     two   -0.657786
baz  one    0.777375
     two   -0.740857
foo  one    0.423715
     two   -0.486913
qux  one    1.108007
     two    0.888711
dtype: float64

In [144]:
data = pd.DataFrame({
    # {'Brand': ['Maruti', 'Hyundai', 'Tata','Mahindra', 'Maruti', 'Hyundai', 'Renault','Tata', 'Maruti'], 
     'Year': [2012, 2014, 2011, 0, 2012, 2016, 2014, 2018, 2019],
'Kms Driven': [50000, 30000, 60000, 25000, 10000, 46000, 31000, 15000, 12000],
# 'City': ['Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Chennai', 'Ghaziabad'],
'Mileage': [28, 27, 25, 26, 28, 29, 24, 21, 24]}
)

In [147]:
data

   Year  Kms Driven  Mileage
0  2012       50000       28
1  2014       30000       27
2  2011       60000       25
3     0       25000       26
4  2012       10000       28
5  2016       46000       29
6  2014       31000       24
7  2018       15000       21
8  2019       12000       24

In [170]:
data.at[[0,0]]

ValueError: Invalid call for scalar access (getting)!